using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

// Общие сведения об этой сборке предоставляются следующим набором
// набора атрибутов. Измените значения этих атрибутов для изменения сведений,
// связанных со сборкой.
[assembly: AssemblyTitle("Электронный телефонный справочник")]
[assembly: AssemblyDescription("Данное программное обеспечение разработано для упрощения работы офисных работников, работающих с клиенской базой. В данном программном продукте содержится  информация о абонентах  (имена обонентов, номера телефонов, email, информацию о месте работы и занемаемой должности). Программа предназначена для удобства при работе с информационными данными электронного телефонного справочника. В программе предусмотрен поиск необходимых «данных» о абонентах, а так же изменение существуюшей и добовление новой информации об абонентах.")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("Группа 11ПЗз-22")]
[assembly: AssemblyProduct("Электронный телефонный справочник")]
[assembly: AssemblyCopyright("Васильев А.В. ©  2020")]
[assembly: AssemblyTrademark("")]
[assembly: AssemblyCulture("")]
// Установка значения False для параметра ComVisible делает типы в этой сборке невидимыми
// для компонентов COM. Если необходимо обратиться к типу в этой сборке через
// COM, следует установить атрибут ComVisible в TRUE для этого типа.
[assembly: ComVisible(false)]

// Следующий GUID служит для идентификации библиотеки типов, если этот проект будет видимым для COM
[assembly: Guid("8d8f6022-408f-4106-a7d4-c1442b9219eb")]

// Сведения о версии сборки состоят из указанных ниже четырех значений:
//
//      Основной номер версии
//      Дополнительный номер версии
//      Номер сборки
//      Редакция
//
// Можно задать все значения или принять номера сборки и редакции по умолчанию 
// используя "*", как показано ниже:
// [assembly: AssemblyVersion("1.0.*")]
[assembly: AssemblyVersion("1.0.0.1")]
[assembly: AssemblyFileVersion("1.0.0.1")]
